<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"00c37ada6d89d9d132b7956af22baab8bbea2dae98f581e4f829d9cfb1bdc489","plan_job_ref":"Job Create terraform plan #2 at https://github.com/Svarrogh1337/sap-task/actions/runs/18246927665","plan_out_hash":"ba53196a1766c4acee7090e6f47965d0dece0fa6027fd3c32a89c3dafdcded11","plan_hash":"b5bac066dad2404fe6ebb699078c556391ecf65a94a759368dc5a53a1474e6bf","plan_text_format":"diff-trunc","version":"2.2.2"} -->
Terraform plan in __./infra__
<details>
<summary>Plan: 66 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_role.ecs_task_execution_role will be created
+   resource "aws_iam_role" "ecs_task_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ecs_task_execution_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "ecs_task_execution_role"
        }
+       tags_all              = {
+           "Name" = "ecs_task_execution_role"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_iam_role will be created
+   resource "aws_iam_role" "ecs_task_iam_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ecs_task_iam_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "ecs_task_iam_role"
        }
+       tags_all              = {
+           "Name" = "ecs_task_iam_role"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "ecs_task_execution_role"
    }

  # module.ecs-primary.aws_alb.alb will be created
+   resource "aws_alb" "alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = (known after apply)
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "sap-infra-primary-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (known after apply)
+       tags                                                         = {
+           "Name" = "sap-infra-primary-alb"
        }
+       tags_all                                                     = {
+           "Name" = "sap-infra-primary-alb"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.ecs-primary.aws_alb_listener.alb_http_listener will be created
+   resource "aws_alb_listener" "alb_http_listener" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "sap-infra-primary-http-listener"
        }
+       tags_all          = {
+           "Name" = "sap-infra-primary-http-listener"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }

+       mutual_authentication (known after apply)
    }

  # module.ecs-primary.aws_alb_target_group.service_target_group will be created
+   resource "aws_alb_target_group" "service_target_group" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "5"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "sap-infra-primary-tg"
+       name_prefix                        = (known after apply)
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Name" = "sap-infra-primary-tg"
        }
+       tags_all                           = {
+           "Name" = "sap-infra-primary-tg"
        }
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 2
+           interval            = 60
+           matcher             = "200"
+           path                = "/health"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 30
+           unhealthy_threshold = 2
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_health_state (known after apply)
    }

  # module.ecs-primary.aws_cloudwatch_log_group.log_group will be created
+   resource "aws_cloudwatch_log_group" "log_group" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/sap-infra-primary/ecs/"
+       name_prefix       = (known after apply)
+       retention_in_days = 1
+       skip_destroy      = false
+       tags              = {
+           "Name" = "sap-infra-primary-lg"
        }
+       tags_all          = {
+           "Name" = "sap-infra-primary-lg"
        }
    }

  # module.ecs-primary.aws_db_instance.default[0] will be created
+   resource "aws_db_instance" "default" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "sapinfraprimarydb"
+       db_subnet_group_name                  = "db subnet group"
+       delete_automated_backups              = true
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_version                        = "8.0"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = (known after apply)
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = "default.mysql8.0"
+       password                              = (sensitive value)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = (known after apply)
+       tags_all                              = (known after apply)
+       timezone                              = (known after apply)
+       username                              = "admin"
+       vpc_security_group_ids                = (known after apply)
    }

  # module.ecs-primary.aws_db_subnet_group.db-subnet will be created
+   resource "aws_db_subnet_group" "db-subnet" {
+       arn                     = (known after apply)
+       description             = "Managed by Terraform"
+       id                      = (known after apply)
+       name                    = "db subnet group"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags_all                = (known after apply)
+       vpc_id                  = (known after apply)
    }

  # module.ecs-primary.aws_default_security_group.infra will be created
+   resource "aws_default_security_group" "infra" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow ALL"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow HTTP inbound"
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow HTTPS inbound"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "sap-infra-primary-scg"
        }
+       tags_all               = {
+           "Name" = "sap-infra-primary-scg"
        }
+       vpc_id                 = (known after apply)
    }

  # module.ecs-primary.aws_ecr_repository.app will be created
+   resource "aws_ecr_repository" "app" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "sap-infra-primary-app"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "sap-infra-primary-ecr"
        }
+       tags_all             = {
+           "Name" = "sap-infra-primary-ecr"
        }

+       image_scanning_configuration {
+           scan_on_push = false
        }
    }

  # module.ecs-primary.aws_ecs_cluster.default will be created
+   resource "aws_ecs_cluster" "default" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "sap-infra-primary-ecs-cluster"
+       tags     = {
+           "Name" = "sap-infra-primary-ecs-cluster"
        }
+       tags_all = {
+           "Name" = "sap-infra-primary-ecs-cluster"
        }

+       setting (known after apply)
    }

  # module.ecs-primary.aws_ecs_service.service will be created
+   resource "aws_ecs_service" "service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 100
+       deployment_minimum_healthy_percent = 50
+       desired_count                      = 3
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "sap-infra-primary-ecs-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Name" = "sap-infra-primary-ecs-service"
        }
+       tags_all                           = {
+           "Name" = "sap-infra-primary-ecs-service"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "sap-infra-primary"
+           container_port   = 80
+           target_group_arn = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }
    }

  # module.ecs-primary.aws_ecs_task_definition.default will be created
+   resource "aws_ecs_task_definition" "default" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "sap-infra-primary-ecs-task-def"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Name" = "sap-infra-primary-ecs-task-def"
        }
+       tags_all                 = {
+           "Name" = "sap-infra-primary-ecs-task-def"
        }
+       track_latest             = false
    }

  # module.ecs-primary.aws_eip.nat_gateway[0] will be created
+   resource "aws_eip" "nat_gateway" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "sap-infra-primary-eip"
        }
+       tags_all             = {
+           "Name" = "sap-infra-primary-eip"
        }
+       vpc                  = (known after apply)
    }

  # module.ecs-primary.aws_eip.nat_gateway[1] will be created
+   resource "aws_eip" "nat_gateway" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "sap-infra-primary-eip"
        }
+       tags_all             = {
+           "Name" = "sap-infra-primary-eip"
        }
+       vpc                  = (known after apply)
    }

  # module.ecs-primary.aws_internet_gateway.public will be created
+   resource "aws_internet_gateway" "public" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "sap-infra-primary-igw"
        }
+       tags_all = {
+           "Name" = "sap-infra-primary-igw"
        }
+       vpc_id   = (known after apply)
    }

  # module.ecs-primary.aws_nat_gateway.nat_gateway[0] will be created
+   resource "aws_nat_gateway" "nat_gateway" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "sap-infra-primary-nat-gw-0"
        }
+       tags_all                           = {
+           "Name" = "sap-infra-primary-nat-gw-0"
        }
    }

  # module.ecs-primary.aws_nat_gateway.nat_gateway[1] will be created
+   resource "aws_nat_gateway" "nat_gateway" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "sap-infra-primary-nat-gw-1"
        }
+       tags_all                           = {
+           "Name" = "sap-infra-primary-nat-gw-1"
        }
    }

  # module.ecs-primary.aws_route53_health_check.route-53_healthcheck will be created
+   resource "aws_route53_health_check" "route-53_healthcheck" {
+       arn               = (known after apply)
+       disabled          = false
+       enable_sni        = (known after apply)
+       failure_threshold = 2
+       fqdn              = (known after apply)
+       id                = (known after apply)
+       measure_latency   = false
+       port              = 80
+       request_interval  = 10
+       resource_path     = "/health"
+       tags              = {
+           "Name" = "sap-infra-primary-PRIMARY-healthcheck"
        }
+       tags_all          = {
+           "Name" = "sap-infra-primary-PRIMARY-healthcheck"
        }
+       type              = "HTTP"
    }

  # module.ecs-primary.aws_route53_record.primary will be created
+   resource "aws_route53_record" "primary" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       health_check_id = (known after apply)
+       id              = (known after apply)
+       name            = "app.eko.dev"
+       set_identifier  = "*****************"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }

+       failover_routing_policy {
+           type = "PRIMARY"
        }
    }

  # module.ecs-primary.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               nat_gateway_id             = (known after apply)
#                (11 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Name" = "sap-infra-primary-private-rt-0"
        }
+       tags_all         = {
+           "Name" = "sap-infra-primary-private-rt-0"
        }
+       vpc_id           = (known after apply)
    }

  # module.ecs-primary.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               nat_gateway_id             = (known after apply)
#                (11 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Name" = "sap-infra-primary-private-rt-1"
        }
+       tags_all         = {
+           "Name" = "sap-infra-primary-private-rt-1"
        }
+       vpc_id           = (known after apply)
    }

  # module.ecs-primary.aws_route_table.public will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = (known after apply)
#                (11 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Name" = "sap-infra-primary-public-rt"
        }
+       tags_all         = {
+           "Name" = "sap-infra-primary-public-rt"
        }
+       vpc_id           = (known after apply)
    }

  # module.ecs-primary.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.ecs-primary.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.ecs-primary.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.ecs-primary.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.ecs-primary.aws_subnet.db[0] will be created
+   resource "aws_subnet" "db" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-central-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.250.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "sap-infra-primary-db-subnet"
        }
+       tags_all                                       = {
+           "Name" = "sap-infra-primary-db-subnet"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.ecs-primary.aws_subnet.db[1] will be created
+   resource "aws_subnet" "db" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-central-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.251.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "sap-infra-primary-db-subnet"
        }
+       tags_all                                       = {
+           "Name" = "sap-infra-primary-db-subnet"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.ecs-primary.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-central-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "sap-infra-primary-private-subnet-1"
        }
+       tags_all                                       = {
+           "Name" = "sap-infra-primary-private-subnet-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.ecs-primary.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-central-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "sap-infra-primary-private-subnet-2"
        }
+       tags_all                                       = {
+           "Name" = "sap-infra-primary-private-subnet-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.ecs-primary.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-central-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "sap-infra-primary-public-subnet-1"
        }
+       tags_all                                       = {
+           "Name" = "sap-infra-primary-public-subnet-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.ecs-primary.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-central-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "sap-infra-primary-public-subnet-2"
        }
+       tags_all                                       = {
+           "Name" = "sap-infra-primary-public-subnet-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.ecs-primary.aws_vpc.infra will be created
+   resource "aws_vpc" "infra" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "sap-infra-primary-vpc"
        }
+       tags_all                             = {
+           "Name" = "sap-infra-primary-vpc"
        }
    }

  # module.ecs-primary.random_password.password will be created
+   resource "random_password" "password" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 16
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "!#$%&*()-_=+[]{}<>:?"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

  # module.ecs-secondary.aws_alb.alb will be created
+   resource "aws_alb" "alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = (known after apply)
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "sap-infra-secondary-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (known after apply)
+       tags                                                         = {
+           "Name" = "sap-infra-secondary-alb"
        }
+       tags_all                                                     = {
+           "Name" = "sap-infra-secondary-alb"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.ecs-secondary.aws_alb_listener.alb_http_listener will be created
+   resource "aws_alb_listener" "alb_http_listener" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "sap-infra-secondary-http-listener"
        }
+       tags_all          = {
+           "Name" = "sap-infra-secondary-http-listener"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }

+       mutual_authentication (known after apply)
    }

  # module.ecs-secondary.aws_alb_target_group.service_target_group will be created
+   resource "aws_alb_target_group" "service_target_group" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "5"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "sap-infra-secondary-tg"
+       name_prefix                        = (known after apply)
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Name" = "sap-infra-secondary-tg"
        }
+       tags_all                           = {
+           "Name" = "sap-infra-secondary-tg"
        }
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 2
+           interval            = 60
+           matcher             = "200"
+           path                = "/health"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 30
+           unhealthy_threshold = 2
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_health_state (known after apply)
    }

  # module.ecs-secondary.aws_cloudwatch_log_group.log_group will be created
+   resource "aws_cloudwatch_log_group" "log_group" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/sap-infra-secondary/ecs/"
+       name_prefix       = (known after apply)
+       retention_in_days = 1
+       skip_destroy      = false
+       tags              = {
+           "Name" = "sap-infra-secondary-lg"
        }
+       tags_all          = {
+           "Name" = "sap-infra-secondary-lg"
        }
    }

  # module.ecs-secondary.aws_db_subnet_group.db-subnet will be created
+   resource "aws_db_subnet_group" "db-subnet" {
+       arn                     = (known after apply)
+       description             = "Managed by Terraform"
+       id                      = (known after apply)
+       name                    = "db subnet group"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags_all                = (known after apply)
+       vpc_id                  = (known after apply)
    }

  # module.ecs-secondary.aws_default_security_group.infra will be created
+   resource "aws_default_security_group" "infra" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow ALL"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow HTTP inbound"
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow HTTPS inbound"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "sap-infra-secondary-scg"
        }
+       tags_all               = {
+           "Name" = "sap-infra-secondary-scg"
        }
+       vpc_id                 = (known after apply)
    }

  # module.ecs-secondary.aws_ecr_repository.app will be created
+   resource "aws_ecr_repository" "app" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "sap-infra-secondary-app"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "sap-infra-secondary-ecr"
        }
+       tags_all             = {
+           "Name" = "sap-infra-secondary-ecr"
        }

+       image_scanning_configuration {
+           scan_on_push = false
        }
    }

  # module.ecs-secondary.aws_ecs_cluster.default will be created
+   resource "aws_ecs_cluster" "default" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "sap-infra-secondary-ecs-cluster"
+       tags     = {
+           "Name" = "sap-infra-secondary-ecs-cluster"
        }
+       tags_all = {
+           "Name" = "sap-infra-secondary-ecs-cluster"
        }

+       setting (known after apply)
    }

  # module.ecs-secondary.aws_ecs_service.service will be created
+   resource "aws_ecs_service" "service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 100
+       deployment_minimum_healthy_percent = 50
+       desired_count                      = 3
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "sap-infra-secondary-ecs-service"
+       platform_version                   = (known after apply)
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create terraform plan #2](https://github.com/Svarrogh1337/sap-task/actions/runs/18246927665)